# олимпиада

# задание 1

# N = int(input("Введите колличество уроков: "))
# A = int(input("Введите длительность урока в минутах: "))
# B = int(input("Введите длительность перемены в минутах: "))

# time = (30+N*A+B*(N-2))

# print(time)

# Задание 2

# A = int(input("Введите колличество этажей в первом подъезде: "))
# B = int(input("Введите колличество этажей во втором подъезде: "))


# Задание 3

# from ast import For, In, Str


# L = int(input())
# R = int(input())
# mas = list(map(str, range(L, R+1)))
# print((len(str(mas))))

# for i in range (mas):
#     number = mas+1
#     print(number)


# print(len(numbers))


